#  Common part

In [1]:
import numpy as np
import pandas as pd

In [2]:
train = pd.read_csv('../input/train.csv')
test = pd.read_csv('../input/test.csv')

In [41]:
#check the first rows of train data set (to check if the import was Ok)
train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",1,27.0,0,0,211536,13.00,NaN,0
887,888,1,1,"Graham, Miss. Margaret Edith",0,19.0,0,0,112053,30.00,B42,0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,28.0,1,2,W./C. 6607,23.45,NaN,0
889,890,1,1,"Behr, Mr. Karl Howell",1,26.0,0,0,111369,30.00,C148,0
890,891,0,3,"Dooley, Mr. Patrick",1,32.0,0,0,370376,7.75,NaN,0

In [40]:
#check the first rows of test data set (to check if the import was Ok)
test.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",1,28.0,0,0,A.5. 3236,8.0500,NaN,0
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,0
415,1307,3,"Saether, Mr. Simon Sivertsen",1,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,0
416,1308,3,"Ware, Mr. Frederick",1,28.0,0,0,359309,8.0500,NaN,0
417,1309,3,"Peter, Master. Michael J",1,28.0,1,1,2668,22.3583,NaN,0

Reclassify all the literal data (except Name; NaN - is not literal, it is Null-value) to numeric to use it in regression models:

In [5]:
# Train data set
train.loc[train['Sex'] == 'male', 'Sex'] = 1
train.loc[train['Sex'] == 'female', 'Sex'] = 0
train.loc[train['Embarked'] == 'S', 'Embarked'] = 0
train.loc[train['Embarked'] == 'C', 'Embarked'] = 0
train.loc[train['Embarked'] == 'Q', 'Embarked'] = 0

# Test data set
test.loc[test['Sex'] == 'male', 'Sex'] = 1
test.loc[test['Sex'] == 'female', 'Sex'] = 0
test.loc[test['Embarked'] == 'S', 'Embarked'] = 0
test.loc[test['Embarked'] == 'C', 'Embarked'] = 0
test.loc[test['Embarked'] == 'Q', 'Embarked'] = 0

Fill the missing values with our assumptions

In [6]:
# Train data set
train['Age'] = train['Age'].fillna(train['Age'].median())
train['Embarked'] = train['Embarked'].fillna(1)
train['Fare'] = train['Fare'].fillna(train['Fare'].mean())

# Test data set
test['Age'] = test['Age'].fillna(train['Age'].median())
test['Embarked'] = test['Embarked'].fillna(1)
test['Fare'] = test['Fare'].fillna(test['Fare'].mean())

***

# Modeling

### Decision Tree Regressor modeling

Based on Kaggle
https://www.kaggle.com/dansbecker/your-first-machine-learning-model

In [12]:
predictors = ["Sex", "Age", "SibSp", "Parch", "Fare", "Embarked"]

In [43]:
from sklearn.tree import DecisionTreeRegressor

# Define model. Specify a number for random_state to ensure same results each run
dtree = DecisionTreeRegressor(random_state=1)

# Fit model
dtree.fit(train[predictors], train['Survived'])
predictions = dtree.predict(test[predictors])

# convert results to binary
n = 0
for i in predictions:
    if(i > 0.5):
        predictions[n] = 1
    else:
        predictions[n] = 0
    n += 1

413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, dtype: int64

In [36]:
#Confusion matrix
#from sklearn.metrics import confusion_matrix
#confusion_matrix(predictions, train['Survived'])

In [37]:
# Accuracy
#from sklearn.metrics import accuracy_score
#accuracy = accuracy_score(train['Survived'], predictions)
#accuracy

# Submission

We need to put our csv-file with the results into Kaggle /input directory like so:

In [44]:
submission = pd.DataFrame({
        "PassengerId": test["PassengerId"],
        "Survived": predictions
    })
submission.to_csv("dtree_submit1.csv", index=False)

### Kaggle API to submit